# Дан список, с помощью цикла for добавить к каждому элементу
# списка слово "_good". Вывести на экран
b = '_good'
arr = ['student1', 'student2', 'student3']
for i in arr:
    i += b
    print(i)