a = [10, 2, 3, 4, 5, 6, 7, 8, 9, 8, 55, 44, 41, 42, 40, 41, 41, 41]
print(a)

# a.append(7)  # добавляет в конец списка
# print(a)

# b = a.count(41)  #     считает количество данной цифры в списке
# print(b)
#
# b = a.index(44)  # выводит индекс заданного элемента, индексация начинается с нуля
# print(b)
#
# b = a.pop(2)  # удаляет эл-нт из списка, выводит элемент из списка, выводит эл-нт который удалил
# print(b)
# print(a)
#
# a.remove(41)  # удаляет только первый по порядку элемент, который совпадает с указанным
# print(a)
#
# a.reverse()  # выводит элементы списка в обратном порядке
# print(a)






