# Вывести на экран все четные значения в диапозоне от 1 до 497
for i in range(1,499):
    if i % 2 == 0:
        print(i, end= ' ')