# Напишите программу, которая определяет, является число четным или нечетным.
chislo = int(input())
if chislo % 2 ==0:
    print('Четное')
else:
    print('Нечетное')