# Напишите программу, которая выводит прямоугольник, по периметру состоящий из
# звездочек (*).
# Примечание. Высота и ширина прямоугольника равны 4 и 17 звёздочкам соответственно.
a = '*'
b = '*'
print(a*17, sep='')
print(a,'               ',a,sep='')
print(a,'               ',a,sep='')
print(a*17, sep='')

