# Напишите программу, которая считывает три числа и подсчитывает сумму только
# положительных чисел.
a, b, c = int(input()), int(input()), int(input())
d = int()
e = int()
f = int()
if a > 0: d = a
if b > 0: e = b
if c > 0: f = c
print(d+e+f)

