# Создать кортеж от 1 до 9 и посчитать его сумму.
summa = 0
a = (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)
for i in a:
    summa += i
print(summa)
