# a = (10, 2.13, "squre", 89, 'C')
# b = [1, 2, 3]
# c = list(a)          # преобразование кортежа в список
# d = tuple(b)         # преобразование списка в кортеж
# print(c, d)

# Кортеж не изменяется, а вложенный в него список изменяется

# nested = (1, 'do', ['param', 10, 20])
# nested[2][1] = 15
# print(nested)

# Объдинение кортежей. Складывать можно только список со списком или кортеж с кортежем

# a = (1, 2, 3, 4)
# b = (6, 7, 8, 9)
# c = a + b
# print(c)

# Умножение кортежей

# d = (1, 2, 3, 4)
# e = d * 5
# print(e)

#  Функции кортежей: count, len

a = (1, 2, 3, 4, 5, 5)
print(a.count(5), len(a))
print('max', max(a), 'min', min(a))

