# Вывести данные кортежа без скобок, через запятую

e = ('1', '2', '3', '4')
b = ','.join(e)
print(b)
